'''
Когда Антон прочитал «Войну и мир», ему стало интересно, сколько слов и в каком количестве используется в этой книге.
Помогите Антону написать упрощённую версию такой программы, которая сможет подсчитать слова, разделённые пробелом и
вывести получившуюся статистику.

Программа должна считывать одну строку со стандартного ввода и выводить для каждого уникального слова в этой строке
число его повторений (без учёта регистра) в формате "слово количество" (см. пример вывода).
Порядок вывода слов может быть произвольным, каждое уникальное слово должно выводиться только один раз.
'''

n = ''  # инициализация строки
n = str(input())
m = [[str(s.lower()) for s in n.split()]]  # инициализация списка

d = {}  # инициализация пустого словаря
li, lj = len(m), len(m[0])
for i in range(li):
    for j in range(lj):
        p = m[i][j]
    if p in d:
        d[p]+=1
    else:
        d[p] = 1
for key, value in d.items():
    print(key, value)



'''
def fuf(v):
  t = v.lower()
  x = t.split()
  x.sort()
  x.reverse()
  print(x)
  count = len(x) - 1
  while count > -1:
  if x[count - 1] != x[count]:
  print(x[count], x.count(x[count]))
  count -= 1
  return



print(fuf(d))
'''